#+TITLE:     Descriptive Statistics
#+AUTHOR:    Nicolas Gast, \textbf{Arnaud Legrand}, Jean-Marc Vincent
#+DATE: RICM4 Probability and Simulation Lecture
#+STARTUP: beamer overview indent
#+TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel-style-preembule.tex}
#+LATEX_HEADER: \AtBeginDocument{\date{RICM4 Probabilities and Simulations\\Grenoble, France, October 2015}}

#+LaTeX: \input{org-babel-document-preembule.tex}

# http://www.cse.wustl.edu/~jain/cse567-08/ftp/k_12smd.pdf

*** I just got new Tees!
- A series of *measurements* (one value per measurement)
- *Nature* of the measurements
  - Factors (*nominal data*)
    #+begin_src R :results output :session :exports results
    set.seed(42);
    options(width=58);
    T_color = sample(size=20, 
        factor(c("Black","Red","Blue","White","Green")), 
        prob=c(.6,.1,.1,.1,.1),replace=T);
    T_color
    #+end_src

    #+RESULTS:
    :  [1] Red   Red   Black Green Blue  Black White Black Blue 
    : [10] White Black White Red   Black Black Red   Red   Black
    : [19] Black Black
    : Levels: Black Blue Green Red White

  - Ordered factors (*ordinal data*)
    #+begin_src R :results output :session :exports results
    options(width=55);
    sizes = c("S","M","L","XL");
    sizes = factor(sizes, levels=sizes, ordered=T)
    T_size = sample(size=20, sizes,
                    prob=c(.05,.75,.1,.05),replace=T);
    T_size
    #+end_src

    #+RESULTS:
    :  [1] XL M  S  XL M  M  M  XL M  L  M  L  M  M  M  L  M 
    : [18] M  XL M 
    : Levels: S < M < L < XL

  - Numbers (e.g., price, duration, \dots) (*numerical data*)
    #+begin_src R :results output :session :exports results
    options(width=58);
    T_price = round(10+rnorm(20,sd=3),digit=1);
    T_price
    #+end_src

    #+RESULTS:
    :  [1]  9.1  4.7  9.5 13.6 15.7  8.7  9.2  4.7 11.4  8.1
    : [11] 11.4 12.1 13.1  8.2 11.5  4.8  7.6  7.4  2.8 10.1

#+begin_src R :results output :session :exports both
str(T_size); # May want to use the str function
#+end_src

#+RESULTS:
:  Ord.factor w/ 4 levels "S"<"M"<"L"<"XL": 4 2 1 4 2 2 2 4 2 3 ...

*** Nominal Values
#+LaTeX: \begin{columns}\begin{column}{.6\linewidth}
- What is the *mode* (most frequent value)?
- Sort values according to their frequency...
  #+begin_src R :results output :session :exports both
  summary(T_color)
  #+end_src

  #+RESULTS:
  : Black  Blue Green   Red White 
  :    11     1     1     2     5

#+LaTeX: \end{column}\begin{column}{.4\linewidth}
  [[file:pdf_babel/ct_bar1.pdf]]

#+LaTeX: \end{column}\end{columns}\bigskip

\small
#+begin_src R :results output graphics :file pdf_babel/ct_bar1.pdf :exports code :width 4.5 :height 4 :session
col_freq=table(T_color);
T_color <- factor(T_color,
    levels = names(col_freq[order(col_freq, decreasing = TRUE)]));
plot(T_color);
#+end_src

#+RESULTS:
[[file:pdf_babel/ct_bar1.pdf]]

*** Ordinal Values
#+LaTeX: \begin{columns}\begin{column}{.5\linewidth}
- What is the *mode* (most frequent value)?
  #+begin_src R :results output :session :exports both
  summary(T_size)
  #+end_src

  #+RESULTS:
  :  S  M  L XL 
  :  1 17  1  1
- May still want to sort values according to their frequency...
- *Median*: not implemented in standard R, as it's not well defined

#+LaTeX: \end{column}\begin{column}{.5\linewidth}
  [[file:pdf_babel/ct_bar2.pdf]]

#+LaTeX: \end{column}\end{columns}

\small

#+begin_src R :results output :session :exports both
median(T_size)
library(DescTools)
median(T_size) # :(
#+end_src

#+RESULTS:
: Error in median.default(T_size) : requires numerical data
: [1] NA

#+begin_src R :results output graphics :file pdf_babel/ct_bar2.pdf :exports none :width 4.5 :height 4 :session
plot(T_size);
#+end_src

#+RESULTS:
[[file:pdf_babel/ct_bar2.pdf]]
*** Numerical Values
#+begin_src R :results output :session :exports both
str(T_price);
#+end_src

#+RESULTS:
:  num [1:20] 14.5 13.1 9.3 6.9 8.6 7.2 7.3 12.4 13.1 16 ...

#+begin_src R :results output :session :exports both
summary(T_price);
#+end_src

#+RESULTS:
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:   5.200   7.275   9.500   9.960  12.580  16.000

- Median: 50% of values are smaller than 7.275\\\quad (a possible measure of *central tendency*)

*** Numerical Values
The *mode* and the *median* are measures of *central tendency* (typical
value)
- *Note*: There may be several modes and it depends on binning...

There is also the (arithmetic) *mean*: $A = \overline{x} = \frac{1}{N}\sum_{i=1}^N x_i$
#+begin_src R :results output :session :exports both
mean(T_price)
#+end_src

#+RESULTS:
: [1] 9.96

#+begin_src R :results output graphics :file pdf_babel/ct_hist.pdf :exports results :width 6 :height 3 :session
df = data.frame(x=rgamma(1000,shape=2));
bw = .5;

bks = hist(df$x,plot=F,breaks=ceiling(diff(range(df$x))/bw));
ibks = bks$counts==max(bks$counts)
Mode = mean(c(bks$breaks[c(ibks,F)], bks$breaks[c(F,ibks)]));

ct = rbind(data.frame(x=median(df$x), label="Median", y=.3),
           data.frame(x=mean(df$x), label="Mean", y=.2),
           data.frame(x=Mode, label="Mode", y=.4));

ggplot(df, aes(x=x, y=..density..)) + theme_bw() +
     geom_histogram(alpha=.3,color="black", fill="gray", binwidth=bw)  +
     geom_vline(data=ct, aes(xintercept=x,color=label),linetype = "longdash") +
     geom_text(data=ct, aes(x=x+.2,y=y,label=label,color=label),hjust=0) +
     scale_color_brewer(palette="Set1");
#+end_src

#+RESULTS:
[[file:pdf_babel/ct_hist.pdf]]

*** Quantile
#+begin_src R :results output :session :exports both
quantile(T_price,c(.05,.25,.5,.75,.95))
#+end_src

#+RESULTS:
:     5%    25%    50%    75%    95% 
:  4.605  7.550  9.150 11.425 13.705

Inter-Quantile Range:
- *Inter-quartile range*: $IQR = Q_{75}-Q_{25}$
- But other values are possible, e.g., $Q_{95}-Q_{5}$
- *Range*: $\max - \min$ (may grow unbounded)
  - quite difficult to use
*** Skewness
Could we illustrate this a bit ? 
#+begin_src R :results output :session :exports both
library(moments)
skewness(runif(1000))
#+end_src

#+RESULTS:
: [1] 0.04626483

#+begin_src R :results output graphics :file pdf_babel/var_2.pdf :exports results :width 6 :height 4 :session
df_skew = function (x) {
  s=skewness(x);
  l=paste("Skewness = ",round(s,digits=3));
  data.frame(x=x,label=l);
}

df = rbind(df_skew(runif(1000,min=0,max=5)),
           df_skew(rnorm(1000)),
           df_skew(rgamma(1000,shape=3)),
           df_skew(10-rgamma(1000,shape=3)));

ggplot(df,aes(x=x,y=..density..)) + theme_bw() +
    geom_histogram(fill="gray",color="black") + facet_wrap(~label);
#+end_src

#+BEGIN_CENTER
  #+ATTR_LaTeX: :width .8\linewidth
  #+RESULTS:
  [[file:pdf_babel/var_2.pdf]]
#+END_CENTER
*** Kurtosis
- peakedness (width of peak), tail weight, lack of shoulders...
- measure infrequent extreme deviations, as opposed to frequent
  modestly sized deviations

$$K = \frac{\tfrac{1}{n} \sum_{i=1}^n (x_i -
\overline{x})^4}{\Bigg[\underbrace{\tfrac{1}{n} \sum_{i=1}^n (x_i -
\overline{x})^2}_{\text{variance}}\Bigg]^2} - 3$$

The *-3* is here so that normal distribution have a Kurtosis of 0

#+begin_src R :results output :session :exports both
library(moments)
x = rnorm(1000) ; var(x);
kurtosis(x)-3
#+end_src

#+RESULTS:
: [1] 1.039743
: [1] 0.01825114

*** Classical information
#+begin_src R :results output :session :exports none
x = rgamma(100,shape=3)
dfx=data.frame(val=x);
#+end_src

#+RESULTS:

#+begin_src R :results output graphics :file pdf_babel/summary_1.pdf :exports results :width 6 :height 3 :session
gghist = function(x) {
  breaks=ceiling(log2(length(x)+1));
  bw = diff(range(x))/breaks;
  ggplot(data.frame(x=x),aes(x=x,y=..density..)) + theme_bw() +
      geom_histogram(fill="gray",color="black",binwidth=bw);
}
gghist(x);
#+end_src

#+RESULTS:
[[file:pdf_babel/summary_1.pdf]]

#+begin_src R :results output :session :exports both
summary(x)
var(x)
#+end_src

#+RESULTS:
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:  0.4065  1.8430  2.5020  2.8660  3.6310  7.0220
: [1] 2.117541
